#include <stdio.h>
#include <stdlib.h>
int shop(int m, int n, int *k, int **c)
{
    int R = m, P = m, i, j, min = m, **D, l;
    D = malloc(n * sizeof(int *));
    if (D == NULL)
        return -1;
    for (i = 0; i < n; i++)
    {
        D[i] = malloc((m + 1) * sizeof(int));
        if (D[i] == NULL)
            return -1;
    }
    for (i = 0; i < n; i++)
        for (j = 0; j < m + 1; j++)
            D[i][j] = 0; //Αρχικοποίηση του πίνακα με 0
    for (j = 0; j < m + 1; j++)
        for (l = 0; l < k[0]; l++)
            D[0][P - c[0][l]] = 1; //Ορίζουμε με 1 τις θέσεις με τα πιθανά χρηματικά ποσά(σύμφωνα με το j)
    for (i = 1; i < n; i++)
        for (j = 0; j < m + 1; j++)
            if (D[i - 1][j] == 1) //Ελέγχουμε αν το στοιχείο της προήγουμενης στήλης είναι 1 για το αντίστοιχο j ώστε να μην γίνουν περιττές επαναλήψεις
            {
                for (l = 0; l < k[i]; l++)
                {
                    if (j - c[i][l] >= 0)
                        D[i][j - c[i][l]] = 1; //Ορίζουμε με 1 τις θέσεις με τα πιθανά χρηματικά ποσά που απομένουν αν αγοράσουμε ένα συνδυασμό i προϊόντων
                }
            }
    for (j = 0; j < m + 1; j++)
        if (D[n - 1][j] == 1)
        {
            R = j; //Όταν βρεθεί το μικρότερο ποσό στον πίνακα(ανάλογα με τον αριθμό της στήλης) σταματάει η αναζήτηση
            break;
        }
    for (i = 0; i < n; i++)
        free(D[i]); //Αποδέσμευση των στηλών του πίνακα D
    free(D);        //Αποδέσμευση των γραμμών του πίνακα D
    return m - R;
}